//Напишите метод, который выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//645 -> 6
//78 -> третьей цифры нет
//32679 -> 6
int[] a = {4,4,8};
if (a[2] > 0)
{
    Console.WriteLine(a[2]);
}
else if (a[2] == 0)
{
    Console.WriteLine(a[2]);
}
else
{
    Console.WriteLine("третьей цифры нет");
}